{
  "seasons": {
    "1": {
      "1": [
        "In the first open view of the playroom. It is coloured blue."
      ],
      "2": [
        "On the front cover of the magazine Bluey gives dad to read. It is just the long dog’s face. It is coloured blue and is smiling."
      ],
      "3": [
        "In the first shot of the playroom, on the bottom left. It is coloured blue."
      ],
      "4": [
        "Next to the plush seat in the Playroom. It is coloured blue.",
        "In the laundry, on top of some clothes, it is a violet colour."
      ],
      "6": [
        "Behind a bush, when Bingo is running to the Backyard. It is coloured green."
      ],
      "8": [
        "Behind the outside wood steps during Bluey’s dream. It is coloured dark blue."
      ],
      "9": [
        "There are two blue long dogs, two of the dogs behind Socks, on the left side.",
        "The other is on the top of the Toy Shelf during the close on Sparkles and Gallahop’s wedding."
      ],
      "10": [
        "When Bluey present at Bandit the camera we can see on a shelf a plant with the long dog face"
      ],
      "12": [
        "In the kindy, on top of a photo shelf. It is coloured light brown.",
        "A blue coloured dog also appears in the Playroom, on top of a bench.",
        "A violet dog also appears in the Laundry."
      ],
      "13": [
        "When Bingo goes to the bathroom we can see a sign of a black long dog outside the bathroom."
      ],
      "14": [
        "On the glass outside of the takeaway, there is a sticker of the long dog."
      ],
      "15": [
        "In the last scene, a brown long dog is standing on the toy block."
      ],
      "16": [
        "In Bandit's workroom we can see a skull of a long dog."
      ],
      "17": [
        "On top of a cabinet, close to Rusty’s house. It is coloured blue."
      ],
      "18": [
        "On the left side of the doctor’s office, on top of a shelf in the Playroom. It is a blue dog wearing Glasses."
      ],
      "19": [
        "The tail end is visible on a shelf on the right side of the screen after Bingo and Bluey make Mum and Dad's bed. It is coloured blue and appears very briefly."
      ],
      "20": [
        "In the middle of some pillows, on a market close to the Pony ride. It is coloured dark blue."
      ],
      "21": [
        "On top of a bush with some rocks, on the left of the Picnic. It is coloured grey blue."
      ],
      "22": [
        "When Bluey, Bingo, and Bandit go to the pool, we can see a statue of a long dog with three eyes."
      ],
      "24": [
        "A white long dog can be found on top of the fridge."
      ],
      "25": [
        "On top of a shelf in the Playroom. It is coloured blue."
      ],
      "26": [
        "Under Bandit when Bluey looks back the first time. It is sand coloured and very small."
      ],
      "27": [
        "Behind a ramp on the playground, below Mum’s spot. It is coloured blue with black ears."
      ],
      "28": [
        "On Nana's fridge door. It is a drawing of a blue dog.",
        "The Heeler's fridge has a blue long dog magnet",
        "On top of the Playroom toy cabinet. It is coloured brown."
      ],
      "29": [
        "When they get in the deeper part of the creek, just when Bluey gets into the water, behind them, on top of a rock. It is coloured Dark Green and has some moss on it."
      ],
      "30": [
        "After Bingo comes out of the food pantry, during the close-up on pasta pots, on the top inside of the elbow macaroni pot. It is a Macaroni dog."
      ],
      "31": [
        "On top of the Playroom toy cabinet. It is coloured brown."
      ],
      "32": [
        "Drawn on a book Barnicus reads to Bumpy. It is coloured blue.",
        "While Barnicus is colouring with Bumpy it’s a Dark Blue on the sheet of paper in the middle of the bed."
      ],
      "33": [
        "First image shot of the trampoline with Bandit and the girls, in the upper left corner in the tree is a brown long dog hiding in the branches."
      ],
      "34": [
        "The Dump entrance, below the entrance sign, and it is coloured green with orange hair on its head.",
        "When Dad launches the chair into the Dump, it is possible to see a sign with another dog, with a dark colour.",
        "When Bluey gets sad and goes to the car’s inside, it is possible to see a light brown dog behind them.",
        "When Dad shows Bluey the Paper Dump another sign shows a white dog with a brown spot.",
        "Seen when Dad throws Bluey's drawing on the Paper Dump, on top of a wooden support behind a metal tube, coloured white with brown ears."
      ],
      "35": [
        "On top of a bench in the Playroom when Bandit as the baboon first sees the banana. It is coloured blue."
      ],
      "36": [
        "Inside of the backyard warehouse, in the foreground next to the wheel. It is coloured light brown."
      ],
      "38": [
        "In the Vet’s main room, on top of some packages on a shelf, above the front desk (top left of the screen). It is coloured white with green spots, the same as the package.",
        "On the top of the Playroom toy cabinet behind Bluey and Chilli when Bingo as the budgie in the backyard. It is coloured brown."
      ],
      "39": [
        "On top of a shelf in the Playroom. It is coloured blue with wavy ears. It can be seen when Bingo, Bluey, and Muffin walk into the restaurant and again to the right of Chilli as she says \"known for our speedy service\"."
      ],
      "40": [
        "There are a Toys of the long dog When we can see the first volt the castle"
      ],
      "41": [
        "Buried inside the sandpit, when Indy and Rusty are hiding. It is coloured light brown."
      ],
      "42": [
        "Behind the pink ball in the Playroom. It is coloured dark blue.",
        "Close to the end, a blue dog can be seen on a bottom shelf in the Playroom when Bluey sees a dragonfly."
      ],
      "43": [
        "When the Heelers are roasting marshmallows, underneath Chilli’s chair. It is coloured yellow."
      ],
      "44": [
        "On the memory snap card of the statue guy when the girls are playing in the tent."
      ],
      "45": [
        "On a supermarket shelf, in the vegetables section, when Bandit finds Rocko. It is a Cucumber dog, and is with the other cucumbers but towards the back."
      ],
      "46": [
        "On the bottom shelf of a bench in the Playroom. It is coloured blue."
      ],
      "47": [
        "The red flag on Chilli's mailbox has a long dog face. When Bluey picks up a book in the bookshelf, on a pink book cover. It is etched in Metal."
      ],
      "48": [
        "When we can see the first volt the Bluey and Bingos' bedroom There Is the plant dog equal at the episode hotel"
      ],
      "49": [
        "On the fridge door. It's dark blue with pink ears.",
        "In the tree with peacock Bandit. It's green and dressed like a snail."
      ],
      "50": [
        "On the fridge door. It's dark blue with pink ears"
      ],
      "51": [
        "On the fridge door. It's dark blue with pink ears.",
        "During a pin the pacifier game in Bluey’s baby shower, there is a blue dog on the bottom of a shelf in the Playroom."
      ],
      "52": [
        "On the last shot of the Heelers house, above the left candy cane lights. It's dark blue and it’s wearing a Christmas Hat."
      ]
    },
    "2": {
      "1": [
        "Outside and and in the station art stores' There is a poster of the long dog"
      ],
      "2": [
        "Behind some boxes, top left of the screen, when they are waiting on the cashier. It is coloured light brown."
      ],
      "3": [
        "On the very first scene of the episode, behind a brown plant pot in the foreground. It is coloured light brown.",
        "The Magnet dog can also be seen on the fridge."
      ],
      "4": [
        "After Stripe gets a drink and When Bandit is begging Bluey to please not let him lose, the long dog can be seen behind the trash can above the racket. It is coloured brown."
      ],
      "5": [
        "On the cover of the magazine Chili is reading while playing Hairdressers with the girls. It is coloured yellow."
      ],
      "6": [
        "On top of the Playroom cabinet. It is coloured brown.",
        "Behind the cooler to the left when Bandit yells to Bluey, \"cause then we're gonna come and do that one\" is a green grass long dog."
      ],
      "7": [
        "On top of the Playroom cabinet. It is coloured brown."
      ],
      "8": [
        "Inside of a white car in Kindy's parking lot. It is coloured white.",
        "In the Kindy, on top of a photo shelf there is a light brown dog."
      ],
      "9": [
        "In Bluey and Bingo’s bedroom, inside of a desk. It is green and is Reading a Book.",
        "Behind a book in the Playroom cabinet, there is a dark blue dog.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "10": [
        "When Bluey, Bingo and Dad are screaming at Lucky’s Dad, on top of the Playroom cabinet there is a blue dog",
        "Same place but a brown dog takes it’s place."
      ],
      "11": [
        "On top of Nana’s green yarn basket to the left of the couch when they first start opening the box of charades. It is coloured green using a green Knit Cap."
      ],
      "13": [
        "When Bluey and her Dad are heading to the Backyard, on top of the Playroom cabinet there is a grey dog",
        "Same place but a brown dog takes it’s place.",
        "The Magnet dog is seen in the fridge door."
      ],
      "14": [
        "On Bluey’s Bedroom balcony, below a stool. It is coloured yellow with alien antennae."
      ],
      "15": [
        "On the fruit basket in the Kitchen. It is yellow with a Cone on its head.",
        "The Magnet dog can be seen in the fridge door."
      ],
      "16": [
        "Behind a flower vase in Jack’s house. It is grey with an Army hat."
      ],
      "17": [
        "Behind the pink ball in the Playroom. Is coloured blue and white with a red bow tie.",
        "Brown dog on top of the Playroom cabinet can also be seen."
      ],
      "18": [
        "Inside de side-way hut, below the bench. It is coloured light blue with a Bike helmet."
      ],
      "19": [
        "In Bluey and Bingo’s bedroom, inside of a desk. It is green and is Reading a Book."
      ],
      "20": [
        "When the tickle crabs are washed back in, behind a bush in the backyard. It is coloured Dark Grass Green.",
        "Brown dog on top of the Playroom cabinet can also be seen."
      ],
      "21": [
        "When the rocket lands on the moon, on the top left of the screen. It is a Space Dog Drawing."
      ],
      "22": [
        "When the grannies are up we can see a pint of the long dog"
      ],
      "23": [
        "In the Study, on top of the desk, behind some books. It is brown, wearing a little Crown."
      ],
      "24": [
        "On the bottom left of the polystyrene city. It is a Polystyrene dog.",
        "At the very end of the episode, it is possible to see the brown dog on top of the Playroom cabinet, but not before, and it is not completely on the screen."
      ],
      "25": [
        "In the episode we can see Snickers."
      ],
      "26": [
        "Appears as a constellation when Bingo and Bluey are running on the planet/Bandit's back."
      ],
      "27": [
        "In Manynard's shed to right corner, brown colour, blends in well."
      ],
      "28": [
        "When the kids call Pom Pom, behind a bench. It is Concrete coloured."
      ],
      "29": [
        "During the Thunderstorm part of the movie, when Bluey hits the movie screen, on the left of it. It is coloured black with white striped arrows."
      ],
      "30": [
        "When Muffin is taking a photo to the Library card, below the sofa. It is coloured brown."
      ],
      "31": [
        "On the left of the rock pond, when Bluey and Mackenzie race their barky boats. It is coloured Dark Grey."
      ],
      "33": [
        "When Bandit is using the tomato sauce, on the grill. It is a Sausage dog."
      ],
      "35": [
        "In the playground, below Bandit’s bench. It is coloured Black."
      ],
      "36": [
        "When Bluey and Bingo gets in the Living room, on the floor. It is a pink Drawing dog.",
        "When Bluey dashes from the wall to the “Lava Boat”, on the Living room cabinet, in the second shelf, there is a brown dog wearing Square Glasses, it also looks like a wooden statue.",
        "The Magnet dog can be seen on the fridge door and in the livingroom There Is a picture of the long dog"
      ],
      "37": [
        "On the left from the Moonlight Unicorns section with a stack of toys, on top of a big green egg. It is coloured cyan."
      ],
      "38": [
        "In the Playroom, at the start of the episode, close to a shelf, behind a blue jacket toy dog (Sans). It looks like a Rag Doll dog."
      ],
      "39": [
        "On Bluey’s Bedroom balcony, behind Frisky. There are actually two dogs, they look like a Couple.",
        "On Bluey’s Bedroom balcony, behind Frisky. There are actually two dogs, they look like a Couple."
      ],
      "40": [
        "When Bluey makes the best house she has ever made, behind the Playroom window door. It is yellow with a Horn Helmet.",
        "In the Study, behind the desk a brown dog appears, wearing a little Crown. It looks like the one from the episode Queens.",
        "The Magnet dog can also be seen on the fridge door, but on the lower one."
      ],
      "41": [
        "In Chloe’s house, in the aquarium. It has a fish colour pattern, like a Fish dog."
      ],
      "42": [
        "In the front of Doreen’s house, behind a bush. It is coloured green. It is only seen on the second night."
      ],
      "43": [
        "When the Muffin seed hatch, on the bottom right of the sprout field. It is coloured Leafy Green and has a Cone."
      ],
      "44": [
        "On the top of the Kitchen cabinet, behind a plant pot. It is coloured light brown."
      ],
      "45": [
        "The Magnet dog can be seen on the fridge door."
      ],
      "46": [
        "On the bottom left of Grey Nomads car back. It is a Car Sticker dog."
      ],
      "47": [
        "In the shop at the start of the episode, on top of a shelf, behind some spiral shells. It is brown and it’s holding what appears to be a yellow fish or shell."
      ],
      "48": [
        "Below the bedside table on the right of the bed. It is light brown."
      ],
      "49": [
        "When Bluey, Winton and Snickers are hiding from Terrier’s bows and arrows, behind a bush, close to some rocks. It is coloured like a rock, with a moustache and a monocle, like a Gentleman."
      ],
      "50": [
        "To the end of the episode, as Bluey backward-walks into the kitchen, a long dog, which looks slightly younger to other versions, is seen above the food cupboard in the background. The Long Dog is coloured brown with a red nappy."
      ],
      "51": [
        "When Bluey brings Bartleby to the kitchen with Chris and Trixie, behind the microwave. It's brown and it's wearing a Christmas Hat."
      ],
      "52": [
        "When Bluey and Bingo get in on the Kitchen balcony, on the side of a green bag. It is white with coloured spots wearing a bunny hat.",
        "When they are looking at the Poinciana petals, on the path to the front yard, behind a bush there is a blue dog."
      ]
    },
    "3": {
      "01": [
        "When Bandit sits on Bluey’s chair, on the fruit bowl in the Kitchen. It is yellow, like a Banana dog.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "02": [
        "In the new bedroom, when Bluey is moving the rug in, below the chair. It has a tuft of hair and is coloured brown."
      ],
      "03": [
        "When Bandit and Bluey are re-matching and Bluey cheats, the long dog can be seen in the dirt under a bush behind Bluey when she is balancing on the jump rope.",
        "When Bandit and Bluey are getting ready for the re-match, the brown dog can be seen on top of the Playroom cabinet."
      ],
      "04": [
        "A brown dog on a shelf and a blue dog on a poster can be seen in the library."
      ],
      "05": [
        "In Wendy’s yard, behind a plant. It is coloured green.",
        "The Magnet dog can also be seen on the fridge door.",
        "When Chilli and Bingo are cooking the last omelette, there’s a white long dog on the red butter wrapper next to the stove."
      ],
      "06": [
        "When Bluey and Bingo tell Bandit to trust them on the street, behind a bush. It is brown and is holding a Pie.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "07": [
        "Close to the crocodile plush in the Playroom. It is yellow with blue dots.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "08": [
        "In the storybook on the page where the Queen has the idea to cover the whole kingdom in leather. Look for a brown dog under the trees on the right hand side of the page."
      ],
      "09": [
        "There is a Pink long dog on the backpack of a child in the far right of the screen.",
        "The dog in the farthest left has two long dogs, with a white being on their phone case",
        "Brown on their luggage, similar to a water mark."
      ],
      "10": [
        "When Bluey is hiding behind the beanbag, in front of a yard bush, It is blue with a purple hat and a beard, like a Wizard dog.",
        "When Bluey and Bingo are controlling Bandit and Pat, on the Playroom wall, there is a long dog made by a bunch of Drawings."
      ],
      "11": [
        "On the frame in the dinner room. It is a brown dog flying with birds."
      ],
      "12": [
        "When Chilli comes into the Kitchen balcony, behind a plant box. It is black with a white wool coat, like a Sheep dog.",
        "The blue dog on the Playroom shelf",
        "The brown dog on top of the Playroom cabinet",
        "The Magnet dog on the fridge door can also be seen."
      ],
      "13": [
        "In the Living room beside the cabinet, under the family picture. It is coloured blue.",
        "Inside the hoover, there is a grey dog, shaped as if it is a Dust dog."
      ],
      "14": [
        "During the first birthday party, a pink dog can be seen in the gifts",
        "During the first birthday party, a dark blue dog can be seen in the gifts.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "15": [
        "In Maynard shop, on top of a bait showcase. It is light brown, wearing a Beanie and holding a Strawberry."
      ],
      "16": [
        "When Bluey and Bingo bring the croc outside, there is a long dog made of four Drawings inside the playroom.",
        "At the same time as the last one, under the Poinciana tree, there is a brown dog."
      ],
      "17": [
        "When Bluey is getting pavlova from the fridge for Bingo, in the edamame beans box. It is an Edamame dog.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "18": [
        "In the Laundry, inside the washing machine. It is coloured pink."
      ],
      "19": [
        "When the girls are about to deliver the mushroom pizza, on the tree bench. It is brown, with a black moustache and a green hat. It is probably a reference to the Nintendo video game character Luigi."
      ],
      "20": [
        "When Bluey is getting the almond milk, behind the wall. It is wearing a pink hat and star glasses like Agatha.",
        "When she is going back to the car, there is a dark green dog with a Horn Helmet on the block house beside Agatha.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "21": [
        "When Tina puts Chilli on the cabinet, next to a pile of toys. It is coloured green.",
        "When Wendy see Bandit and Chilli throwing Tina into the car there's an invisible long dog on the ground behind Wendy.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "22": [
        "Below the TV stand. It is coloured green.",
        "When Bluey and Bingo leave the Living room, on a couch cushion. It is coloured green."
      ],
      "23": [
        "In the toy box that Bingo holds, the first time that you see it. There is a white long dog amongst the other toys."
      ],
      "24": [
        "The Magnet dog can be seen on the fridge door.",
        "When Muffin drops the phone for the last time and the camera is spinning in the corner, a dark green long dog can be seen at the top left of the Heeler house under a hedge."
      ],
      "25": [
        "When the kids get Bandit to the stairs, beside the furniture. It is purple and looks like a Ragdoll dog.",
        "In the Laundry, inside the washing machine. It is coloured pink."
      ],
      "26": [
        "On the shop with the arcade, on the candy showcase, below the pink sticks. It is a pink Candy Stick dog."
      ],
      "27": [
        "The Magnet dog can be seen on the fridge door.",
        "On the rug when Bluey starts dancing to 'I Love cereal` #1",
        "On the rug when Bluey starts dancing to 'I Love cereal` #2",
        "On the rug when Bluey starts dancing to 'I Love cereal` #3"
      ],
      "28": [
        "When Coco speaks to Winton, below the tables. It is blue and looks like it is made of beeswax, like a Beeswax dog.",
        "When Winton and Indy are getting to the book shelf, behind the pillows. It is brown with big eyebrows and great muscles, like a Muscular dog."
      ],
      "29": [
        "When Unicorse starts crying, behind the coffee bottle. It is white like a paper sheet and is holding a hand puppet, like a Ventriloquist dog."
      ],
      "30": [
        "Before Bingo and Bandit leaves the park for the last time, in the shot with the eucalyptus, inside an eucalyptus seed pod on the top right. It is brown with a flower on its head."
      ],
      "31": [
        "When the girls go answer the door, behind the stool with the keys. It is using an orange Cheetah Onesie."
      ],
      "32": [
        "When the tradies come on the second day, on Sparky’s Ute. It is yellow and is a Car Hanging dog."
      ],
      "33": [
        "When the Heelers first pass through Doreen’s garage sale, below a table, in front of a blue box. It is coloured blue.",
        "On the lolly jar Doreen gives to Muffin, there is a dog with brown spots."
      ],
      "34": [
        "When Rusty is rescuing Mackenzie from the aliens, on the bottom left among the flowers. It is pale yellow with petal wings, like the Fairy Aliens."
      ],
      "35": [
        "When Chilli is hiding from the girls, on a couch cushion. It is coloured green, like the one from Whale Watching.",
        "When Bingo is threatening Bandit with the basil, beside the fridge, there is a brown dog under a box with an eye patch. This is probably a reference to a character from the video game series Metal Gear Solid, Solid Snake.",
        "The Magnet dog can also be seen on the fridge door."
      ],
      "36": [
        "In Wendy's bathroom, behind the bathtub. It is grey with a green nose and much Hair."
      ],
      "37": [
        "In Lucky’s house, on top of a brown plushy on a toy basket. It is coloured brown."
      ],
      "38": [
        "After Kim Jim is done eating there is a faraway shot that includes the kitchen and a teal long dog is seen on the counter.",
        "When Bandit starts crawling through the cubby. It is in the first room and is coloured blue.",
        "Immediately after the collapse of the playhouse next to the pink flag there is a blue long dog.",
        "After the collapse of the play house, behind Bluey's tail and under two yellow cushions. It is yellow.",
        "When Kimjim has finished to eat outside the cubby There Is a Yellow pillow on up the long dog."
      ],
      "39": [
        "In the toy bin at Bandit's doctor's office. It is purple."
      ],
      "40": [
        "In the cupboard behind the plates when Chilli is looking for dishwashing detergent. It's grey.",
        "After Bluey and Bingo get out of the bath. The shell picture over the toilet has a white long dog disguised as a mermaid."
      ],
      "41": [
        "In the puddle at the beginning of the episode when Bluey and Bingo are running in front of their parents. It's Turquoise and its bottom is in a shell.",
        "After Bingo’s stick bird is destroyed. Bingo and Bandit are walking back to the stick pile. It’s a brown long dog disguised as a stick in the middle of the screen."
      ],
      "42": [
        "On top of the painted traffic signal box in front of Stafford State School (just after they leave the cemetery). It's Light Green.",
        "When they reach their destination, there is a brown long dog on the top surfboard hanging on the wall of the garage."
      ],
      "43": [
        "A white long dog with what looks to be wings is located in the treasure chest located at the bottom right of the screen when Bandit drives the family out of the cave."
      ],
      "44": [
        "A brown long dog can be seen in the dirt in front of Coco’s shelter at the very end of the episode, before Coco and Indy dance for the last time."
      ],
      "45": [
        "White long dog on the red box as Bandit walks into the chemist #1",
        "White long dog on the red box as Bandit walks into the chemist #2",
        "When Bingo runs past a white dog a brown long dog can be seen on the box toward the middle of the screen.",
        "Toward the end of the episode a light green long dog is on the bottom shelf to the left of the entrance when Bluey runs to see Coco."
      ],
      "46": [
        "After Bandit connects the water hose, a light purple long dog can be seen under the stairs of Lucky’s house."
      ],
      "47": [
        "A white long dog is on top of the air conditioning unit at Rusty’s house. The long dog has a cricket bat in his mouth."
      ],
      "48": [
        "A dark green long dog can be seen on the couch cushion in the Sun room.",
        "A long dog magnet can be seen on the fridge as well."
      ],
      "49": [
        "On their way to school, the Heelers pass the electricity box which has a long dog sitting on it.",
        "When Chilli opens the car boot, a blue and purple long dog can be seen on the right, It is obscured from the audience's view as Chilli moves a bag in front of it",
        "When Chilli is almost catching up to Frisky's car, on a green painted wall.",
        "When Chilli parked the bobo near Aunt Frisky's car, there is long dog peeking in front of Frisky's tire.",
        "Near Aunt Frisky's car, At the wedding party, the Busker has a laptop with a grey long dog as a logo, on backside of display. Similar to an Apple MacBook/Laptop."
      ],
      "50": [
        "The white dog can be seen at the start of the episode.",
        "A grey long dog can be seen next to the tablet in the flash forward, wearing goggles that have green on them, as if a futuristic design."
      ]
    }
  }
}